"""
#eg.1
7+8
7*8
8/2
8/3
10+5/2
(10+5)/2
(10+(5*(2-7)))/2
"""

"""
#eg.2
a = 100
b = 120
c = a+b
print(c)

a = 100
b = 120
c = a
print(c)
a = 200
print(c)
"""

"""
#eg.3
a = 300
b = 220
c = 180
d = a+180+b/20+c*56
print(d)
#重新输入a,b的值
a = 33
b = 22
print(d)
#发现两次结果都一样
#====================== RESTART: D:\EV3\Python\day_02.py ======================
#10571.0
#10571.0
#因此需要重新粘贴d的值。
a = 33
b = 22
c = 180
d = a+180+b/20+c*56
print(d)
"""

"""
#eg.4
a = 100
b = 120
a > b
a == b
a != b
a+20 > b
a+90 > b
"""





"""
知识点
1.  运算符[优先级]

    括号>乘除>加减
    
2.  变量的定义
    1)不能数字开头，eg[3zyy = 3]
    2)不能空格，eg[zyy 3 = 10]
    3)可以数字加字母加下划线，eg[zyy_1,zyy_2,zyy]

"""
